Autodesk.Revit.DB.Fabrication.PartialFailureResults
Possible results of the partial failure from invoking the DesignToFabricationConverter.
Since:
2017
Since:
2017

Autodesk.Revit.DB.Fabrication.PartialFailureResults.NoMatchingSize
There are no matching sizes found.

Autodesk.Revit.DB.Fabrication.PartialFailureResults.HaveDifferentOffsets
Converted fabrication parts have different offsets.

Autodesk.Revit.DB.Fabrication.PartialFailureResults.HaveOpenConnectors
Converted fabrication parts have open ends.

Autodesk.Revit.DB.Fabrication.PartialFailureResults.InvalidConnections
The connections are invalid.

Autodesk.Revit.DB.Fabrication.PartialFailureResults.NotAllPartsConverted
Not all design elements were converted.